In [1]:
import pandas as pd

In [2]:
Customer_data=pd.read_csv(r"D:\Data\customer_segmentation_data.csv")

In [3]:
Customer_data.head()

,id,age,gender,income,spending_score,membership_years,purchase_frequency,preferred_category,last_purchase_amount
0,1,38,Female,99342,90,3,24,Groceries,113.53
1,2,21,Female,78852,60,2,42,Sports,41.93
2,3,60,Female,126573,30,2,28,Clothing,424.36
3,4,40,Other,47099,74,9,5,Home & Garden,991.93
4,5,65,Female,140621,21,3,25,Electronics,347.08

In [4]:
Customer_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    1000 non-null   int64
 1   age                   1000 non-null   int64
 2   gender                1000 non-null   object
 3   income                1000 non-null   int64
 4   spending_score        1000 non-null   int64
 5   membership_years      1000 non-null   int64
 6   purchase_frequency    1000 non-null   int64
 7   preferred_category    1000 non-null   object
 8   last_purchase_amount  1000 non-null   float64
dtypes: float64(1), int64(6), object(2)
memory usage: 70.4+ KB

In [5]:
Customer_data.isnull().sum().sum()

0

In [6]:
Customer_data.describe()

,id,age,income,spending_score,membership_years,purchase_frequency,last_purchase_amount
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.00000,1000.000000,1000.000000
mean,500.500000,43.783000,88500.800000,50.685000,5.46900,26.596000,492.348670
std,288.819436,15.042213,34230.771122,28.955175,2.85573,14.243654,295.744253
min,1.000000,18.000000,30004.000000,1.000000,1.00000,1.000000,10.400000
25%,250.750000,30.000000,57911.750000,26.000000,3.00000,15.000000,218.762500
50%,500.500000,45.000000,87845.500000,50.000000,5.00000,27.000000,491.595000
75%,750.250000,57.000000,116110.250000,76.000000,8.00000,39.000000,747.170000
max,1000.000000,69.000000,149973.000000,100.000000,10.00000,50.000000,999.740000

In [7]:
Customer_data["age"].describe()

count    1000.000000
mean       43.783000
std        15.042213
min        18.000000
25%        30.000000
50%        45.000000
75%        57.000000
max        69.000000
Name: age, dtype: float64

In [9]:
Customer_data['gender'].value_counts()

gender
Male      357
Other     327
Female    316
Name: count, dtype: int64

In [12]:
bins=[18,25,35,45,55,100]
labels=['18-25','26-35','36-45','46-55','56+']
Customer_data['Age-grouped']=pd.cut(Customer_data["age"],bins=bins,labels=labels)

In [13]:
Customer_data['Age-grouped']

0      36-45
1      18-25
2        56+
3      36-45
4        56+
       ...
995      56+
996    18-25
997    18-25
998    18-25
999    36-45
Name: Age-grouped, Length: 1000, dtype: category
Categories (5, object): ['18-25' < '26-35' < '36-45' < '46-55' < '56+']

In [17]:
Customer_data['Income level']=pd.qcut(Customer_data['income'],q=3,labels=['Low','Middle','High'])

In [19]:
Customer_data[['Age-grouped','Income level','spending_score']]

    Age-grouped Income level  spending_score
0         36-45       Middle              90
1         18-25       Middle              60
2           56+         High              30
3         36-45          Low              74
4           56+         High              21
..          ...          ...             ...
995         56+         High              57
996       18-25          Low              76
997       18-25         High              40
998       18-25         High              63
999       36-45       Middle               7

[1000 rows x 3 columns]

In [20]:
Customer_data.groupby("Age-grouped")['spending_score'].mean()

Age-grouped
18-25    44.609756
26-35    51.737374
36-45    56.494382
46-55    46.985366
56+      51.581818
Name: spending_score, dtype: float64

In [21]:
Customer_data.groupby("Income level")['spending_score'].mean()

Income level
Low       51.020958
Middle    50.495495
High      50.537538
Name: spending_score, dtype: float64

### From here the most customers from 36-45 age group with low income customers are buying the products

In [23]:
(Customer_data[['Age-grouped','Income level','spending_score']]).describe()

       spending_score
count     1000.000000
mean        50.685000
std         28.955175
min          1.000000
25%         26.000000
50%         50.000000
75%         76.000000
max        100.000000

In [26]:
Customer_data.groupby("Age-grouped")['preferred_category'].count()

Age-grouped
18-25    123
26-35    198
36-45    178
46-55    205
56+      275
Name: preferred_category, dtype: int64

In [27]:
Customer_data.groupby("preferred_category")['Age-grouped'].count()

preferred_category
Clothing         166
Electronics      209
Groceries        195
Home & Garden    202
Sports           207
Name: Age-grouped, dtype: int64

In [30]:
Customer_data.groupby(["Age-grouped","preferred_category"])['Age-grouped'].count()

Age-grouped  preferred_category
18-25        Clothing              20
             Electronics           31
             Groceries             23
             Home & Garden         25
             Sports                24
26-35        Clothing              30
             Electronics           46
             Groceries             36
             Home & Garden         41
             Sports                45
36-45        Clothing              26
             Electronics           32
             Groceries             48
             Home & Garden         36
             Sports                36
46-55        Clothing              43
             Electronics           41
             Groceries             33
             Home & Garden         45
             Sports                43
56+          Clothing              47
             Electronics           59
             Groceries             55
             Home & Garden         55
             Sports                59
Name: Age-grouped, dtype: int64